var galleryInfo = [
    {
        id: 1,
        title: "书房中的圣哲罗姆",
        description: `
安托内罗·达·梅西那
<br />（活跃于1456后-1479）
<br />约1475年，石灰板油画
<br />本次展览是一趟关乎“图像制作”的历史之旅，它开始于早期文艺复兴大师安托内罗·达·梅西那。梅西那效仿早期尼德兰大师的油画技法，尤其是对细节的精确描绘和影调色彩的微妙变化。他以高超的技艺再现圣哲罗姆（公元四世纪的圣徒，将《圣经》从希腊语翻译成拉丁语）书房中的各种事物及其各自不同的质地。这件作品曾被误认为出自扬·凡·艾克之手。
<br />在这个哥特式教堂般的空间中，圣哲罗姆正在一间十五世纪最先进的书房中阅读。档案表明，佛罗伦萨的统治者洛伦佐·美第奇很可能就拥有类似装配有嵌入式书架和书桌的书房。
        `,
        x: 3070,
        z: -350,

        paintCubeX: 631,
        paintCubeY: 800,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 1800,
        wallY: 1000,
        wallZ: 40,
        faceid: 5,
        offX: 0,
        offZ: -1
    },

    {
        id: 2,
        title: "圣泽诺比乌斯的三个奇迹",
        description: `
桑德罗·波提切利（约1445–1510年）
<br />约1500年
<br />木板蛋彩画，64.8 x 139.7厘米
<br />波提切利是15世纪后半叶佛罗伦萨黄金时代领军人物，创作了许多脍炙人口的宗教神话作品。
<br />这幅作品描绘了5世纪佛罗伦萨主教泽诺比乌斯的三个奇迹故事，画面左侧，泽诺比乌斯正在治疗两个因殴打自己母亲而遭到诅咒的年轻人，当两个小恶魔从他们嘴中冒出时，一旁的母亲惊恐地捂住了脸。画面中心，一名心急如焚的妇女将死去的儿子抱在膝上，泽诺比乌斯对着男孩祷念使他死而复生。画面右侧，一个盲人乞丐坐在教堂的台阶上，泽诺比乌斯将手指放在盲人眼睛上使他复明。这幅作于波提切利职业生涯后期的作品体现了艺术家更为虔诚和简单的技法。
        `,
        x: 6070,
        z: -350,

        paintCubeX: 1981,
        paintCubeY: 952,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 2100,
        wallY: 1000,
        wallZ: 40,
        faceid: 5,
        offX: 0,
        offZ: -1
    },

    {
        id: 3,
        title: "圣母子与施洗者圣约翰（加瓦圣母）",
        description: `
拉斐尔（1483–1520）
<br />约1510–1511年
<br />木板油画，38.9 x 32.9厘米
<br />拉斐尔是文艺复兴盛期三杰中最年轻的一位，虽英年早逝，但其笔下优雅柔美的圣母像都被后世奉为“完美”的典范。这幅作品可能是拉斐尔受梵蒂冈教廷内一名成员委托，为私人祭祀所用，而“加瓦圣母”得名于作品的前一任持有者第一代加瓦男爵。
<br />这幅作品描绘了一个动态瞬间，小耶稣正从其表兄施洗者圣约翰手中接过一只康乃馨，此花象征神圣的爱以及耶稣的受难。圣母似乎沉浸在忧郁的思绪中，她一只手用蓝色斗篷拢抱基督，另一只手则轻抚身穿皮毛的圣约翰。三位圣像之间的心理互动既复杂又感人，拉斐尔通过三角形的几何结构呈现出绝对和谐的视觉效果。
        `,
        x: 8200,
        z: -1950,

        paintCubeX: 40,
        paintCubeY: 900,
        paintCubeZ: 900,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 1,
        offX: -1,
        offZ: 0
    },
    {
        id: 4,
        title: "年轻公主（丹麦多萝西娅？）",
        description: `
扬·戈塞特（活跃于1508年，卒于1532年）
<br />约1530–1532年
<br />橡木板油画，38.2 x 29.1厘米
<br />画中的小女孩可能是丹麦流亡国王克里斯蒂安二世的女儿多萝西娅（1520-1580）。她身上华贵的连衣裙由数百颗珍珠缝制而成，长袖和帽子与虚构的画框重叠，仿佛来到画面之外。多萝西娅手拿一个上下颠倒的浑天仪，指向赤道以北大约55度的位置，可能暗指她父亲失落的王国。球体的金属带上刻着一个字谜，可能是艺术家的名字，这种视觉谜题或隐晦表达在文艺复兴时期非常流行。
<br />戈塞特是一位十分受欢迎的宫廷艺术家，也是最早游历罗马的北方文艺复兴画家之一。
        `,
        x: 8200,
        z: -4650,

        paintCubeX: 40,
        paintCubeY: 924,
        paintCubeZ: 707,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 1,
        offX: -1,
        offZ: 0
    },
    {
        id: 5,
        title: "四元素：火",
        description: `
这两幅大型画作属于《四元素系列》，该系列分别描绘了泥土、空气、火和水四种元素。其中三幅画是安特卫普市场场景，而《四元素：火》设定在一个16世纪初的厨房内。四幅作品中的人物直视我们，展示着他们提供的货品。
<br />在《四元素 ：火》中，透过房门，我们可以看到耶稣正在玛莎和玛丽的家中，玛丽选择倾听耶稣的教导，而不是帮助她的妹妹玛莎准备食物。
        `,
        x: 8200,
        z: -7350,

        paintCubeX: 40,
        paintCubeY: 900,
        paintCubeZ: 1229,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 1,
        offX: -1,
        offZ: 0
    },
    {
        id: 6,
        title: "四元素：水",
        description: `
《四元素系列》的每幅作品都在前景中描绘抓人眼球的现代场景，以衬托远处背景中隐含的圣经主题。
<br />《四元素：水》的背景中可以看到一个渔夫正拖着渔网，这里讲述的是圣经中一个奇迹场景：复活后的耶稣出现在信徒面前，告诉他们在船的另一边撒网，就会收获很多鱼。
        `,
        x: 6070,
        z: -9200,


        paintCubeX: 1235,
        paintCubeY: 900,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 1800,
        wallY: 1000,
        wallZ: 40,
        faceid: 4,
        offX: 0,
        offZ: 1
    },
    {
        id: 7,
        title: "被蜥蜴咬伤的男孩",
        description: `
画面中一个年轻人刚刚被蜥蜴咬伤，神情痛苦，在惊讶中往后退缩。蜥蜴被瞬间从桌上水果间的藏匿处拉出来，正顽强地抓住男孩的手指。这幅画介于风俗画和静物画之间，可能隐喻了短暂感官享受背后所带来的意外痛苦。卡在男孩耳后的花朵和玻璃花瓶里的鲜花也同样暗示转瞬即逝：随着花瓣的飘零，它们的美丽也会消失。

<br />卡拉瓦乔是艺术史上最具革命性的人物之一。他的原创画作引人注目，以其强烈的自然主义和戏剧性的光线运用，对欧洲艺术产生了持久的影响。
<br />作品中高度逼真的静物描绘，反映了卡拉瓦乔一贯的艺术主张：画静物和画人物一样需要极高的艺术技巧。卡拉瓦乔还极其重视观察自然，并提倡绘画要直接从自然中而来，这也是他艺术最具开创性的特点之一。
        
        `,
        x: 3070,
        z: -9200,

        paintCubeX: 670,
        paintCubeY: 900,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 1800,
        wallY: 1000,
        wallZ: 40,
        faceid: 4,
        offX: 0,
        offZ: 1
    },
    {
        id: 8,
        title: "约翰·斯图亚特勋爵与其兄弟",
        description: `
这幅真人大小的双人肖像画描绘了第三代伦诺克斯公爵的两个小儿子。左侧的约翰勋爵手臂倚靠石座凝视远方，而伯纳德勋爵则回头看向我们，仿佛我们打断了他俩的私人谈话。
<br />站于台阶下方的是哥哥，他掀开斗篷，露出了昂贵的银色衬里，手肘朝向我们伸出，靴子上尖锐的马刺也指向我们，这些细节进一步强化了他的傲慢。兄弟俩的姿势和华丽的丝绸服饰彰显出他们的财富、精致生活和与生俱来的优越感。这幅画的俯视视角也从侧面暗示了画中人物居高临下的态度。

<br />安东尼·凡·戴克是继鲁本斯之后最重要的17世纪佛兰德画家之一，年轻时曾为鲁本斯工作。他深受意大利文艺复兴艺术，尤其是提香的影响。凡·戴克是一名出色的肖像画家，凭借精湛的技巧描绘奢华服饰上闪闪发光的纹理而深受贵族客户的追捧。
        `,
        x: 70,
        z: -9200,

        paintCubeX: 543,
        paintCubeY: 900,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 1800,
        wallY: 1000,
        wallZ: 40,
        faceid: 4,
        offX: 0,
        offZ: 1
    },
    {
        id: 9,
        title: "威尼斯：卡纳雷吉欧区入口",
        description: `
卡纳莱托（乔瓦尼·安东尼奥·卡纳尔）（1697–1768）
<br />1734–1742年
<br />布面油画，48 x 80.2 厘米
<br />卡纳尔是18世纪威尼斯画派的重要成员，他的单名卡纳莱托（“小卡纳尔”）更为人熟知。画家以精心勾勒的城市风景见长，常用暗箱记录景观，然后在工作室中完成创作。英国收藏家尤欣赏其笔下的威尼斯风光，将之作为壮游的纪念品带回国。为满足市场需要，他渐加强与画坊的合作，绘制程式化但技艺娴熟的风景。此画再现了卡纳雷吉欧运河的入口，画家调整了水面视角以展现两岸建筑。远处是建于1580年的方尖塔桥，桥右为犹太人聚居区，左侧为圣格雷米亚教堂，教堂的钟楼始建于十三世纪，是威尼斯最古老的钟楼之一。这一作品在当时广受好评，有多个版本存世。
        `,
        x: -1680,
        z: -7350,

        paintCubeX: 40,
        paintCubeY: 900,
        paintCubeZ: 1448,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 0,
        offX: 1,
        offZ: 0
    },
    {
        id: 10,
        title: "威尼斯：城堡区圣伯多禄圣殿",
        description: `
《威尼斯：城堡区圣伯多禄圣殿》卡纳莱托，
<br />1730年，布面油画
<br />18世纪是欧洲的“壮游”（又称“雅游”）时代。
<br />富裕的英法国家的年轻人，去意大利进行文化旅行，当地的画家就会画一些风景画当做纪念品售卖，那么在展厅的第六个板块，我们可以看到这方面的代表作，比如卡纳莱托的一些作品。
        `,
        x: -1680,
        z: -4650,

        paintCubeX: 40,
        paintCubeY: 900,
        paintCubeZ: 1516,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 0,
        offX: 1,
        offZ: 0
    },
    {
        id: 11,
        title: "咖啡厅演奏会的一角",
        description: `
爱德华·马奈（1832–1883年）
<br />约1878–1880年
<br />布面油画，97.1 x 77.5厘米
<br />马奈是法国印象派画家，是印象派的重要先驱。他主张直接临摹实景实物，并在现代生活中选取新颖的题材作画，自由处理颜料及光影效果，呈现了现实生活的城市缩影。1872年起，马奈创作了多幅展示巴黎咖啡馆、花园音乐会、小餐馆的作品，其中包括此画作。酒馆的女服务员端着许多杯啤酒服侍客人时能做到一滴不洒，马奈对此尤感兴趣，因而他邀请店中技艺最娴熟的女服务员作为他的模特，绘制大尺幅作品。但在创作过程中，他决定将作品一分为二，分别完成。这幅作品为右半部分，左半部分现藏于瑞士温特图尔的莱因哈特艺术馆。
        `,
        x: -1680,
        z: -1950,

        paintCubeX: 40,
        paintCubeY: 900,
        paintCubeZ: 731,
        paintY: 500,
        wallX: 40,
        wallY: 1000,
        wallZ: 1800,
        faceid: 0,
        offX: 1,
        offZ: 0
    },
    {
        id: 12,
        title: "红衣男孩",
        description: `
19世纪初的英国以肖像画和风景画最为突出，这次展出的代表作品是劳伦斯爵士的《红衣男孩》和透纳的《海洛和利安德的离别》。

<br />《红衣男孩》是有史以来第一幅登上英国邮票的画作。画框是画家劳伦斯爵士本人从一个商人那里选配的，非常华丽、精致。

<br />它描绘了一个贵族小孩查尔斯，六七岁的模样，全套红丝绒的外套，天真漂亮的脸庞无可挑剔。他坐在大自然的岩石椅上，用手撑着脑袋，无邪地远眺月夜下的大海。
<br />小男孩本人在13岁的时候，因为肺结核去世了，这也更加平添了这幅作品的珍贵性。
        `,
        x: 70,
        z: -350,

        paintCubeX: 626,
        paintCubeY: 800,
        paintCubeZ: 40,
        paintY: 500,
        wallX: 1800,
        wallY: 1000,
        wallZ: 40,
        faceid: 5,
        offX: 0,
        offZ: -1
    },

];


var LocalPlayerInitLocation = [2300, 0, -1000];
var NPCInitLocation = [2300, 0, -600];