var chatMessage = [
    `按 F 进行对话`,
    `<b>导览员Jimmy</b>：欢迎来到云端艺术学堂！这个教室的主题是 <b>“从波提切利到梵高：英国国家美术馆珍藏展”</b> ，是今年上海博物馆开年大展的线上轻量复刻，我们精心挑选了其中12幅画作放在场景中供大家观赏，祝您看得愉快！
    <br />有什么能帮到您的吗？
    <br />
    <br />1.关于云端艺术学堂
<br />2.关于这个教室
<br />3.让我自己逛逛吧`,
    `<b>导览员Jimmy</b>：云端艺术学堂是由复旦大学2020级软件工程专业的4位同学开发的在线学堂，在这里你可以学习知识、参与答题、兑换礼品，进行愉悦的学习。
    <br />目前已经完成了<b>“从波提切利到梵高：英国国家美术馆珍藏展”</b>这一画展的轻量化复刻，欢迎体验！`,
    `<b>导览员Jimmy</b>：这个教室的主题是 <b>“从波提切利到梵高：英国国家美术馆珍藏展”</b>汇聚了从波提切利、拉斐尔、提香、戈塞特、卡拉瓦乔、伦勃朗、克劳德到塞尚、马奈、莫奈以及梵高在内的欧洲艺术巨匠的52件经典画作，呈现横跨400余年的欧洲美术史缩影。
    <br />从第一幅作品安托内罗·达·梅西那《书房中的圣哲罗姆》、贝利尼《圣母子》开篇，循着作品的“指引”，可一路欣赏到文艺复兴时期的艺术、巴洛克艺术、印象派和后印象派以及英国浪漫主义艺术等。而诸如拉斐尔、卡拉瓦乔、莫奈和梵高等一些公众耳熟能详的艺术史名家名作则如耀目的珍珠点缀其间。此次展览是上海博物馆 “对话世界”文物艺术系列大展第二个展览，也是与英国国家美术馆的首次合作。`

]